{
  "greeting": "Hello! I'm a first-year master's student living by turning my weaknesses into strengths! 💪",
  "profile": {
    "name": "Koki Nakagawa",
    "role": "Japan / Master's student of Information Systems / Engineer"
  },
  "selfIntro": {
    "title": "Abstract",
    "content": "A first-year master's student majoring in Information Systems at Toyama Prefectural University.<br />During junior high and high school, I played Splatoon for 5000 hours. I was a self-proclaimed 'useless person' who slept during class and played games until morning after getting home.<br />Disgusted with myself, I decided to change.<br />I entered graduate school in 2025 and plan to study abroad for a year in 2026 to realize my dreams."
  },
  "tags": {
    "government": "Government",
    "dx": "DX Promotion",
    "onStage": "Speaking",
    "presentation": "Presentation",
    "lab": "Lab",
    "research": "Research",
    "psychology": "Social Psychology",
    "leadership": "Leadership",
    "education": "Education",
    "ta": "TA",
    "overseas": "Overseas",
    "entrepreneurship": "Entrepreneurship",
    "frontend": "Frontend",
    "backend": "Backend",
    "design": "Design",
    "uiux": "UI/UX",
    "chrome": "Chrome Extension",
    "iot": "IoT",
    "team": "Team Dev",
    "hackathon": "Hackathon",
    "personal": "Personal Dev"
  },
  "projects": {
    "dxSupporter": {
      "title": "Toyama Prefectural Government DX Promotion Supporter",
      "description": "Employed as a DX Promotion Supporter (part-time staff) in the Digital Promotion Office"
    },
    "osakaExpo": {
      "title": "Kansai-Osaka Expo Speaker",
      "description": "Gave a speech on the theme 'What It Means to Change Yourself' for young people"
    },
    "masterResearch": {
      "title": "Master's Research",
      "description": "Predicting regretful smartphone usage"
    },
    "bachelorResearch": {
      "title": "Bachelor's Research",
      "description": "Examining the effect of gradual self-disclosure through music preference sharing on acceptance"
    },
    "connectech": {
      "title": "ConnecTech",
      "description": "Research group established within the laboratory"
    },
    "webLectureTA": {
      "title": "Web Lecture TA",
      "description": ""
    },
    "portlandProgram": {
      "title": "Portland Entrepreneurship Program",
      "description": ""
    }
  },
  "development": {
    "zundamonX": {
      "title": "ZUNDAMON-X",
      "description": "Real-time dubbing of overseas YouTube videos with a cute voice"
    },
    "questBoard": {
      "title": "Quest Board",
      "description": "A bulletin board service for managing and participating in projects at student organization POLYGON"
    },
    "gameGallery": {
      "title": "Game Gallery",
      "description": "A web app created to introduce games I'm playing or like to my Twitter followers"
    },
    "ragSystem": {
      "title": "Budget Request Reference System",
      "description": "A RAG system combined with Azure OpenAI to make budget request references easier"
    },
    "todoApp": {
      "title": "ToDo App",
      "description": "A ToDo app created with Next.js × Azure as teaching material"
    },
    "seichiCrossOver": {
      "title": "Seichi Cross Over",
      "description": "A matching service for foreign anime fans to connect with Japanese people for pilgrimage tours"
    },
    "oyaClass": {
      "title": "Oya class",
      "description": "A service for elementary school teachers and parents that solves the problem of school newsletters getting lost in desks"
    },
    "keycaps": {
      "title": "KeyCaps",
      "description": "My first web app mimicking a shopping site"
    },
    "grantFinder": {
      "title": "Grant Information Collection System",
      "description": "A system that automatically collects grant information from the J-Grants API"
    },
    "springIot": {
      "title": "Spring Project IoT Team",
      "description": "A web app that displays information about our university's DX Center using IoT sensors"
    },
    "fantarest": {
      "title": "Fantarest",
      "description": "A mobile platform for discovering what you love in Toyama"
    },
    "electionDx": {
      "title": "House of Councillors Election DX",
      "description": "Automated voting result reporting using Forms and Power Automate"
    }
  },
  "bio": [
    {
      "year": "2021.3",
      "description": "Graduated from Toyama Prefectural Takaoka Technical High School, Department of Electronic Machinery"
    },
    {
      "year": "2021.4",
      "description": "Entered Toyama Prefectural University, Faculty of Engineering, Department of Information Systems Engineering"
    },
    {
      "year": "2023.4",
      "description": "Appointed as DX Promotion Supporter at Toyama Prefectural Government"
    },
    {
      "year": "2023.10",
      "description": "Assigned to Iwamoto-Kawasaki Laboratory (Social Information System Design Laboratory)"
    },
    {
      "year": "2025.3",
      "description": "Graduated from Toyama Prefectural University, Faculty of Engineering, Department of Information Systems Engineering"
    },
    {
      "year": "2025.4",
      "description": "Entered Toyama Prefectural University Graduate School, Master's Program in Electronics and Information Engineering"
    },
    {
      "year": "2026.4",
      "description": "Planning to take a year off to study abroad in the Philippines and Canada"
    }
  ],
  "developmentSection": {
    "intro": "Started programming in December 2022",
    "frontend": "Frontend: Web application development using Next.js/TypeScript",
    "design": "Design: Simple UI design using Figma, styling with TailwindCSS and MUI",
    "backend": "Backend: Creating simple REST APIs using Python and Go, backend using open APIs",
    "cloud": "Cloud Services: Full-stack development using Azure and AWS",
    "experience": "I have created a Chrome extension that dubs overseas videos in real-time and a service for managing student organization projects like a game bulletin board. In my work, I have developed full-stack ToDo app teaching materials and a RAG system for referencing past budget requests in government using Azure",
    "current": "Currently, I'm not just focused on web app development. Inspired by the self-expression of artists and creators, I'm challenging myself in areas I once gave up on: game development, vlog creation (video shooting and editing), and mobile app development for my master's research."
  },
  "hobby": {
    "gaming": {
      "title": "Gaming:",
      "description": "I absolutely love games like Splatoon and Fantasy Life"
    },
    "photography": {
      "title": "Photography:",
      "description": "I capture beautiful moments with my Sony α7C2. I love portrait photography"
    },
    "singing": {
      "title": "Singing:",
      "description": "I've performed at school festivals twice and at a wedding once! I love expressing myself through singing"
    },
    "snowboarding": {
      "title": "Snowboarding:",
      "description": "There's nothing like riding down snowy mountains. I love powder snow and ground tricks"
    }
  },
  "article": {
    "loading": "Loading articles...",
    "noArticles": "No articles found",
    "noteNotice": "Articles are written in Japanese on the note platform."
  },
  "technicalStack": "Technical Stack",
  "aboutMe": {
    "skillsIntro": "I have been mainly developing web applications since December 2022. Recently, I've been improving my cloud services, game development, and video editing skills",
    "frontend": "I mainly develop using Next.js. I've won hackathons three times and gained a lot of experience through internships and personal projects",
    "backend": "I can develop simple REST APIs and connect to databases using Go and TypeScript. I can also build simple applications using open APIs (e.g., Spotify Web API, grant APIs, Slack API, etc.)",
    "general": "Languages I've learned in university classes or on my own. Currently learning C# for game development",
    "cloud": "I have experience developing in cloud environments for government and university projects. Mainly responsible for deployment, function apps, databases, and AI services",
    "design": "I handle everything from design to styling using Figma. I use TailwindCSS and MUI for styling",
    "dxPromotion": "Tools I've used for automating and streamlining work at Toyama Prefectural Government",
    "other": "I use a wide range of tools for version control, project management, video/image editing, and game development"
  }
}
